# St7GetTHAInitialAttributeOverride

Returns the state of the override flag to be used with the transient heat analysis initial conditions file.

long St7GetTHAInitialAttributeOverride(long uID, bool* Active)
Input Parameters
uID
Strand7 model file ID.
Output Parameters
Active
True if the initial result file temperatures override nodal temperature attributes.